Repository: iDams/NotchTerminal
Catalog: NotchTerminal/*.lproj/Localizable.strings
Languages: es, fr, ja

# app.tagline
source: A terminal emulator that lives in your notch.
es: Un emulador de terminal que vive en tu notch.
fr: Un émulateur de terminal qui vit dans votre notch.
ja: ノッチに住むターミナルエミュレーター。

# settings.general
source: General
fr: Général
ja: 一般

# settings.appearance
source: Appearance
es: Apariencia
fr: Apparence
ja: 外観

# settings.about
source: About
es: Acerca de
fr: À propos
ja: 情報

# settings.experimental
source: Experimental
fr: Expérimental
ja: 実験的

# settings.system
source: System
es: Sistema
fr: Système
ja: システム

# settings.system.subtitle
source: Core behavior and app visibility options.
es: Comportamiento principal y opciones de visibilidad de la app.
fr: Comportement principal et options de visibilité de l'application.
ja: コア動作とアプリの表示オプション。

# settings.hapticFeedback
source: Enable haptic feedback
es: Activar retroalimentación háptica
fr: Activer le retour haptique
ja: 触覚フィードバックを有効にする

# settings.hapticFeedback.subtitle
source: Use haptics when interactions occur in the notch.
es: Usa hápticas cuando hay interacciones en el notch.
fr: Utilise le retour haptique lors des interactions dans le notch.
ja: ノッチでのインタラクション時に触覚を使用します。

# settings.showDockIcon
source: Show Dock icon
es: Mostrar icono en el Dock
fr: Afficher l'icône dans le Dock
ja: Dockアイコンを表示

# settings.showDockIcon.subtitle
source: Display the app icon in the Dock using the configured AppIcon asset.
es: Muestra el icono de la app en el Dock usando el recurso AppIcon.
fr: Affiche l'icône de l'application dans le Dock en utilisant l'asset AppIcon.
ja: AppIconアセットを使用してDockにアプリアイコンを表示します。

# settings.quitApp
source: Quit application
es: Salir de la aplicación
fr: Quitter l'application
ja: アプリを終了

# settings.quitApp.subtitle
source: Close NotchTerminal completely.
es: Cierra NotchTerminal por completo.
fr: Ferme complètement NotchTerminal.
ja: NotchTerminalを完全に終了します。

# settings.automation
source: Automation
es: Automatización
fr: Automatisation
ja: 自動化

# settings.automation.subtitle
source: Controls how and when the notch opens and closes.
es: Controla cómo y cuándo se abre y cierra el notch.
fr: Contrôle comment et quand le notch s'ouvre et se ferme.
ja: ノッチが開閉するタイミングと方法を制御します。

# settings.autoOpenOnHover
source: Open notch on hover
es: Abrir notch al pasar el cursor
fr: Ouvrir le notch au survol
ja: ホバー時にノッチを開く

# settings.autoOpenOnHover.subtitle
source: Automatically expands the notch when the cursor reaches it.
es: Expande automáticamente el notch cuando el cursor llega.
fr: Développe automatiquement le notch lorsque le curseur l'atteint.
ja: カーソルが到達すると自動的にノッチを展開します。

# settings.lockWhileTyping
source: Keep open while typing
es: Mantener abierto mientras escribes
fr: Garder ouvert pendant la saisie
ja: 入力中に開いたままにする

# settings.lockWhileTyping.subtitle
source: Avoid auto-close while you are actively typing.
es: Evita el cierre automático mientras escribes activamente.
fr: Évite la fermeture automatique pendant que vous tapez activement.
ja: 入力中に自動的に閉じることを防ぎます。

# settings.terminalActions
source: Terminal Actions
es: Acciones de Terminal
fr: Actions du terminal
ja: ターミナルアクション

# settings.terminalActions.subtitle
source: Bulk actions, safety checks, and per-chip behavior.
es: Acciones masivas, verificaciones de seguridad y comportamiento por chip.
fr: Actions groupées, vérifications de sécurité et comportement par puce.
ja: 一括アクション、安全チェック、チップごとの動作。

# settings.showChipCloseButton
source: Show close button on chip hover
es: Mostrar botón de cerrar al pasar sobre chip
fr: Afficher le bouton fermer au survol de la puce
ja: チップホバー時に閉じるボタンを表示

# settings.showChipCloseButton.subtitle
source: Display a small close button when hovering a terminal chip.
es: Muestra un pequeño botón de cerrar al pasar el cursor sobre un chip.
fr: Affiche un petit bouton fermer lors du survol d'une puce.
ja: ターミナルチップをホバーときに小さい閉じるボタンを表示します。

# settings.confirmBeforeCloseAll
source: Confirm before Close All
es: Confirmar antes de Cerrar Todo
fr: Confirmer avant Tout fermer
ja: すべて閉じる前に確認

# settings.confirmBeforeCloseAll.subtitle
source: Ask for confirmation before closing every terminal window.
es: Pide confirmación antes de cerrar todas las ventanas de terminal.
fr: Demande confirmation avant de fermer toutes les fenêtres de terminal.
ja: すべてのターミナルウィンドウを閉じる前に確認を求めます。

# settings.closeActionMode
source: Close action mode
es: Modo de acción de cerrar
fr: Mode d'action Fermer
ja: 閉じるアクションのモード

# settings.closeActionMode.subtitle
source: Defines what Close does in chip/context/bulk actions.
es: Define qué hace Cerrar en acciones de chip/contexto/masivas.
fr: Définit ce que fait Fermer dans les actions puce/contexte/groupées.
ja: チップ/コンテキスト/一括アクションで閉じるを実行した時の動作を定義します。

# settings.closeActionMode.closeWindow
source: Close window only
es: Solo cerrar ventana
fr: Fermer uniquement la fenêtre
ja: ウィンドウのみ閉じる

# settings.closeActionMode.terminateProcess
source: Terminate process and close
es: Terminar proceso y cerrar
fr: Terminer le processus et fermer
ja: プロセスを終了して閉じる

# settings.dangerZone
source: Danger Zone
es: Zona de riesgo
fr: Zone sensible
ja: 危険ゾーン

# settings.dangerZone.subtitle
source: Sensitive actions that affect the whole app.
es: Acciones sensibles que afectan toda la app.
fr: Actions sensibles qui affectent toute l'application.
ja: アプリ全体に影響する慎重な操作です。

# settings.appearance.geometry
source: Geometry
es: Geometría
fr: Géométrie
ja: ジオメトリ

# settings.appearance.geometry.subtitle
source: Fine-tune notch layout and spacing.
es: Ajusta finamente el diseño y espaciado del notch.
fr: Ajustez finement la disposition et l'espacement du notch.
ja: ノッチのレイアウトとスペーシングを微調整します。

# settings.contentPadding
source: Content padding
es: Relleno de contenido
fr: Remplissage du contenu
ja: コンテンツパディング

# settings.contentPadding.subtitle
source: Spacing between terminal content and notch edges.
es: Espaciado entre el contenido del terminal y los bordes del notch.
fr: Espacement entre le contenu du terminal et les bords du notch.
ja: ターミナルコンテンツとノッチ端の間の間隔。

# settings.notchWidthOffset
source: Notch width fine-tune
es: Ajuste fino del ancho del notch
fr: Ajustement fin de la largeur du notch
ja: ノッチ幅の微調整

# settings.notchWidthOffset.subtitle
source: Adjust horizontal notch size offset.
es: Ajusta el desplazamiento horizontal del tamaño del notch.
fr: Ajuste le décalage horizontal de la taille du notch.
ja: ノッチサイズの水平オフセットを調整します。

# settings.notchHeightOffset
source: Notch height fine-tune
es: Ajuste fino de la altura del notch
fr: Ajustement fin de la hauteur du notch
ja: ノッチ高さの微調整

# settings.notchHeightOffset.subtitle
source: Adjust vertical notch size offset.
es: Ajusta el desplazamiento vertical del tamaño del notch.
fr: Ajuste le décalage vertical de la taille du notch.
ja: ノッチサイズの垂直オフセットを調整します。

# settings.appearance.terminalDefaults
source: Terminal Window Defaults
es: Valores predeterminados de ventana de terminal
fr: Valeurs par défaut de la fenêtre terminal
ja: ターミナルウィンドウのデフォルト

# settings.appearance.terminalDefaults.subtitle
source: Size parameters for new terminal sessions.
es: Parámetros de tamaño para nuevas sesiones de terminal.
fr: Paramètres de taille pour les nouvelles sessions de terminal.
ja: 新しいターミナルセッションのサイズパラメータ。

# settings.terminalDefaultWidth
source: Default width
es: Ancho predeterminado
fr: Largeur par défaut
ja: デフォルト幅

# settings.terminalDefaultWidth.subtitle
source: Horizontal size in points.
es: Tamaño horizontal en puntos.
fr: Taille horizontale en points.
ja: 水平サイズ（ポイント）。

# settings.terminalDefaultHeight
source: Default height
es: Altura predeterminada
fr: Hauteur par défaut
ja: デフォルト高さ

# settings.terminalDefaultHeight.subtitle
source: Vertical size in points.
es: Tamaño vertical en puntos.
fr: Taille verticale en points.
ja: 垂直サイズ（ポイント）。

# settings.appearance.docking
source: Docking Sensitivity
es: Sensibilidad de acoplamiento
fr: Sensibilité d'ancrage
ja: 停泊感度

# settings.appearance.docking.subtitle
source: How close a window needs to be to snap into the notch.
es: Qué tan cerca debe estar una ventana para ajustarse al notch.
fr: À quelle distance une fenêtre doit être pour s'ancrer dans le notch.
ja: ウィンドウがノッチにスナップするために必要な近さ。

# settings.notchDockingSensitivity
source: Detection radius
es: Radio de detección
fr: Rayon de détection
ja: 検出半径

# settings.notchDockingSensitivity.subtitle
source: Larger means earlier detection, smaller requires getting closer.
es: Más grande significa detección más temprana, más pequeño requiere acercarse más.
fr: Plus grand signifie détection plus précoce, plus petit nécessite d'être plus proche.
ja: 大きいほど早期検出、小さいほど近づく必要があります。

# settings.appearance.compactTicker
source: Compact Ticker
es: Ticker compacto
fr: Ticker compact
ja: コンパクトティッカー

# settings.appearance.compactTicker.subtitle
source: Provider status in closed-notch mode.
es: Estado del proveedor en modo notch cerrado.
fr: État du fournisseur en mode notch fermé.
ja: ノッチ閉じた状態でのプロバイダー状態。

# settings.compactTickerEnabled
source: Show compact provider ticker
es: Mostrar ticker de proveedor compacto
fr: Afficher le ticker de fournisseur compact
ja: コンパクトプロバイダーティッカーを表示

# settings.compactTickerEnabled.subtitle
source: When the notch is closed, rotate provider status in a compact row.
es: Cuando el notch está cerrado, rota el estado del proveedor en una fila compacta.
fr: Lorsque le notch est fermé, fait défiler l'état du fournisseur dans une rangée compacte.
ja: ノッチが閉じているとき、プロバイダー状態コンパクトな行でローテーションします。

# settings.compactTickerInterval
source: Rotation interval
es: Intervalo de rotación
fr: Intervalle de rotation
ja: ローテーション間隔

# settings.compactTickerInterval.subtitle
source: How often the provider preview changes.
es: Con qué frecuencia cambia la vista previa del proveedor.
fr: À quelle fréquence l'aperçu du fournisseur change.
ja: プロバイダープレビューが変化する頻度。

# settings.compactTickerClosedExtraWidth
source: Closed notch extra width
es: Ancho extra del notch cerrado
fr: Largeur supplémentaire notch fermé
ja: 閉じたノッチの追加幅

# settings.compactTickerClosedExtraWidth.subtitle
source: Extra width available in compact mode.
es: Ancho extra disponible en modo compacto.
fr: Largeur supplémentaire disponible en mode compact.
ja: コンパクトモードで利用可能な追加幅。

# settings.experimental.effects
source: Experimental Effects
es: Efectos experimentales
fr: Effets expérimentaux
ja: 実験的エフェクト

# settings.experimental.effects.subtitle
source: Optional visuals that may vary by screen/GPU.
es: Visuales opcionales que pueden variar según pantalla/GPU.
fr: Visuels optionnels qui peuvent varier selon l'écran/GPU.
ja: 画面/GPUによって異なる場合があります。

# settings.experimental.warning
source: These visual effects are highly experimental and cost battery life.
es: Estos efectos visuales son altamente experimentales y consumen batería.
fr: Ces effets visuels sont hautement expérimentaux et consomment de la batterie.
ja: これらの視覚エフェクトはバッテリーを消費します。

# settings.fakeNotchGlow
source: Fake Notch Glow
es: Brillo de notch simulado
fr: Lueur de notch simulé
ja: フェイクノッチグロー

# settings.fakeNotchGlow.subtitle
source: Neon purple glow effect for simulated notches.
es: Efecto de brillo néon morado para notches simulados.
fr: Effet de lueur néon violet pour les notches simulés.
ja: シミュレートされたノッチのネオン紫グローエフェクト。

# settings.auroraBackground
source: Aurora Background
es: Fondo Aurora
fr: Fond Aurore
ja: オーロラ背景

# settings.auroraBackground.subtitle
source: Animated Metal shader behind the terminal contents.
es: Shader de Metal animado detrás del contenido del terminal.
fr: Shader Metal animé derrière le contenu du terminal.
ja: ターミナルコンテンツの後ろにアニメーション付きMetalシェーダー。

# settings.crtFilter
source: CRT Monitor Filter
es: Filtro de monitor CRT
fr: Filtre écran CRT
ja: CRTモニターフィルター

# settings.crtFilter.subtitle
source: Adds curvature, scanlines, and static noise to emulate old hardware.
es: Añade curvatura, scanlines y ruido estático para emulate hardware antiguo.
fr: Ajoute courbure, scanlines et bruit statique pour imiter le ancien matériel.
ja: 曲線、スキャンライン、静電ノイズを追加して古いハードウェアをエミュレートします。

# settings.language
source: Language
es: Idioma
fr: Langue
ja: 言語

# settings.language.subtitle
source: Choose your preferred language.
es: Elige tu idioma preferido.
fr: Choisissez votre langue préférée.
ja: お好みの言語を選択してください。

# settings.language.system
source: System Default
es: Predeterminado del sistema
fr: Par défaut du système
ja: システムデフォルト

# settings.language.system.subtitle
source: Uses your system's language setting.
es: Usa el idioma configurado en tu sistema.
fr: Utilise la langue configurée sur votre système.
ja: システムの言語設定を使用します。

# settings.about.version
source: Version 1.0.0
es: Versión 1.0.0
ja: バージョン 1.0.0

# settings.about.checkUpdates
source: Check for Updates
es: Buscar actualizaciones
fr: Vérifier les mises à jour
ja: アップデートを確認

# settings.about.checkUpdates.subtitle
source: Looks for newer versions
es: Busca versiones más recientes
fr: Recherche des versions plus récentes
ja: 新しいバージョンを確認します

# settings.about.releaseNotes
source: Release Notes
es: Notas de lanzamiento
fr: Notes de version
ja: リリースノート

# settings.about.releaseNotes.subtitle
source: See what changed
es: Ver qué cambió
fr: Voir ce qui a changé
ja: 変更点を見る

# settings.about.website
source: Project Website
es: Sitio web del proyecto
fr: Site web du projet
ja: プロジェクトウェブサイト

# settings.about.website.subtitle
source: Repository and documentation
es: Repositorio y documentación
fr: Dépôt et documentation
ja: リポジトリとドキュメント

# settings.about.donate
source: Buy Me a Coffee
es: Cómprame un café
fr: M'offrir un café
ja: コーヒーを奢る

# settings.about.donate.subtitle
source: Support development
es: Apoya el desarrollo
fr: Soutenir le développement
ja: 開発をサポート

# settings.about.thirdParty
source: View Third-Party Notices
es: Ver avisos de terceros
fr: Voir les avis tiers
ja: サードパーティの情報を表示

# settings.about.copyright
source: © 2026 Marco Astorga González. All rights reserved. Released as open source.
es: © 2026 Marco Astorga González. Todos los derechos reservados. Lanzado como código abierto.
fr: © 2026 Marco Astorga González. Tous droits réservés. Publié en open source.
ja: © 2026 Marco Astorga González. 全著作権所有。オープンソースとして公開。

# action.restore
source: Restore
es: Restaurar
fr: Restaurer
ja: 復元

# action.minimize
source: Minimize
es: Minimizar
fr: Minimiser
ja: 最小化

# action.close
source: Close
es: Cerrar
fr: Fermer
ja: 閉じる

# action.closeAll
source: Close All
es: Cerrar todo
fr: Tout fermer
ja: すべて閉じる

# action.restoreAll
source: Restore All
es: Restaurar todo
fr: Tout restaurer
ja: すべて復元

# action.minimizeAll
source: Minimize All
es: Minimizar todo
fr: Tout minimiser
ja: すべて最小化

# action.moveToThisDisplay
source: Move to this Display
es: Mover a esta pantalla
fr: Déplacer vers cet écran
ja: このディスプレイに移動

# action.alwaysOnTop
source: Always on Top
es: Siempre-visible
fr: Toujours au premier plan
ja: 常に最前面

# action.disableAlwaysOnTop
source: Disable Always on Top
es: Desactivar siempre-visible
fr: Désactiver toujours au premier plan
ja: 常に最前面を無効

# action.reorganize
source: Reorganize Terminals
es: Reorganizar terminales
fr: Réorganiser les terminaux
ja: ターミナルを再編

# action.settings
source: Settings
es: Configuración
fr: Paramètres
ja: 設定

# action.newTerminal
source: New Terminal
es: Nueva terminal
fr: Nouveau terminal
ja: 新しいターミナル

# action.quit
source: Quit
es: Salir
fr: Quitter
ja: 終了

# menu.bulkActions
source: Bulk actions
es: Acciones masivas
fr: Actions groupées
ja: 一括アクション

# menu.closeAllOnThisDisplay
source: Close All on This Display
es: Cerrar todo en esta pantalla
fr: Tout fermer sur cet écran
ja: このディスプレイですべて閉じる
